Tekla Open API Reference for Tekla Structures 2025
FormBorders.RestoreFormSizeAndLocation Method (Window)
 Restores the WPF window size and location from the registry.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void RestoreFormSizeAndLocation(
	Window window
)
Public Shared Sub RestoreFormSizeAndLocation (
	window As Window
)
Parameters
window
Type: System.Windows.Window
The form in question.
See Also
Reference
FormBorders Class
RestoreFormSizeAndLocation Overload
Tekla.Structures.Dialog Namespace